Results/2Baremetal/resultsMEM.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 32MiB each
4GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      390.70
    writes/s:                     260.47
    fsyncs/s:                     833.84

Throughput:
    read, MiB/s:                  6.10
    written, MiB/s:               4.07

General statistics:
    total time:                          120.0874s
    total number of events:              178210

Latency (ms):
         min:                                    0.00
         avg:                                    0.67
         max:                                   18.83
         95th percentile:                        3.82
         sum:                               119711.40

Threads fairness:
    events (avg/stddev):           178210.0000/0.00
    execution time (avg/stddev):   119.7114/0.00